In [1]:
import pandas as pd

In [4]:
!head datasets/en-wikipedia.humans.ungraph.names.txt

# Node names
# NodeId NodeName
0	Alexander Seton (d. 1332)
31	Ularbek Baitailaq
108	Albert P. Forsythe
159	Luca Segantini
171	Jacques Moeschal (architect)
172	Jacques Moeschal (footballer)
174	Fred Armstrong (mayor)
185	James Williamson (priest)

In [16]:
df_nodes = pd.read_csv("datasets/en-wikipedia.humans.ungraph.names.txt", comment="#", delimiter="\t", names=["id", "name"])

In [17]:
df_nodes.head()

    id                          name
0    0     Alexander Seton (d. 1332)
1   31             Ularbek Baitailaq
2  108            Albert P. Forsythe
3  159                Luca Segantini
4  171  Jacques Moeschal (architect)

In [10]:
!head datasets/en-wikipedia.humans.ungraph.txt

# Directed graph: ../datasets/en-wikipedia.humans.ungraph.txt
# Nodes: 1014428 Edges: 3923957
# FromNodeId	ToNodeId
185	186
185	191
186	185
186	187
187	186
187	188
188	187

In [18]:
df_edges = pd.read_csv("datasets/en-wikipedia.humans.ungraph.txt", comment="#", delimiter="\t", names=["id", "src", "dst"])

In [19]:
df_edges.head()

    id  src  dst
0  185  186  NaN
1  185  191  NaN
2  186  185  NaN
3  186  187  NaN
4  187  186  NaN

In [13]:
!head datasets/en-wikipedia.humans.ungraph.features.txt

# Node features
# NodeId FeatureList
0	758752
31	758758 758772
108	50 91 138 479 554 861 1668 3405 6387 11242 12041 19378 20462 39172 55878 66377 143837 187927 203505 367505
159	283447
171	67
172	1 67 1418 2456 9781 19864 229996
174	28508
185	35535

In [20]:
df_features = pd.read_csv("datasets/en-wikipedia.humans.ungraph.features.txt", comment="#", delimiter="\t", names=["id", "features"])

In [21]:
df_features.head()

    id                                           features
0    0                                             758752
1   31                                      758758 758772
2  108  50 91 138 479 554 861 1668 3405 6387 11242 120...
3  159                                             283447
4  171                                                 67

In [23]:
df_features["features"] = df_features.features.str.split(" ")

In [24]:
df_features.head()

    id                                           features
0    0                                           [758752]
1   31                                   [758758, 758772]
2  108  [50, 91, 138, 479, 554, 861, 1668, 3405, 6387,...
3  159                                           [283447]
4  171                                               [67]

In [25]:
!head datasets/en-wikipedia.humans.ungraph.features.names.txt

# Node feature names
# FeatureId FeatureName
0	United States
1	Association football
2	England
3	Germany
4	World War II
5	London
6	France
7	United Kingdom

In [28]:
df_features_names = pd.read_csv("datasets/en-wikipedia.humans.ungraph.features.names.txt", comment="#", delimiter="\t", names=["id", "name"])

In [29]:
df_features_names.head()

   id                  name
0   0         United States
1   1  Association football
2   2               England
3   3               Germany
4   4          World War II